## 1. Read data file.

In [3]:
import numpy as np
import pandas as pd
data = pd.read_csv("data.csv")
data.head()

   Number of Kids  Working Experience(years)  Age  Salary Blood Types
0               3                       15.0   45  250000           A
1               1                        5.0   30  200000           B
2               2                       10.0   38  150000          AB
3               1                        NaN   36  180000           O

## 2. Clean the missing data using median approach

In [5]:
data["Working Experience(years)"].fillna(data["Working Experience(years)"].median(),inplace = True)
data.head()

   Number of Kids  Working Experience(years)  Age  Salary Blood Types
0               3                       15.0   45  250000           A
1               1                        5.0   30  200000           B
2               2                       10.0   38  150000          AB
3               1                       10.0   36  180000           O

## 3. Finding Correlation between Number of Kids and Working Experience

In [20]:
data["Number of Kids"].corr(data["Age"])

0.9147673836616229

In [22]:
data["Number of Kids"].corr(data["Working Experience(years)"])

0.8528028654224418

==> Age is more related

## 4. One Hot Vectors

In [10]:
blood_types_encoded,categories=data["Blood Types"].factorize()
blood_types_encoded

array([0, 1, 2, 3])

In [11]:
from sklearn.preprocessing import OneHotEncoder
encoder = OneHotEncoder(sparse=False)
blood_type_cat_1hot = encoder.fit_transform(blood_types_encoded.reshape(-1,1))
blood_type_cat_1hot

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [12]:
data.head()

   Number of Kids  Working Experience(years)  Age  Salary Blood Types
0               3                       15.0   45  250000           A
1               1                        5.0   30  200000           B
2               2                       10.0   38  150000          AB
3               1                       10.0   36  180000           O

In [13]:
one_hot=pd.get_dummies(data,columns=["Blood Types"],drop_first=False,prefix='',prefix_sep='')
one_hot

   Number of Kids  Working Experience(years)  Age  Salary  A  AB  B  O
0               3                       15.0   45  250000  1   0  0  0
1               1                        5.0   30  200000  0   0  1  0
2               2                       10.0   38  150000  0   1  0  0
3               1                       10.0   36  180000  0   0  0  1

In [14]:
data=data.drop("Blood Types",axis=1)
data

   Number of Kids  Working Experience(years)  Age  Salary
0               3                       15.0   45  250000
1               1                        5.0   30  200000
2               2                       10.0   38  150000
3               1                       10.0   36  180000

In [15]:
data=data.join(one_hot["A"])
data=data.join(one_hot["B"])
data=data.join(one_hot["AB"])
data=data.join(one_hot["O"])
data

   Number of Kids  Working Experience(years)  Age  Salary  A  B  AB  O
0               3                       15.0   45  250000  1  0   0  0
1               1                        5.0   30  200000  0  1   0  0
2               2                       10.0   38  150000  0  0   1  0
3               1                       10.0   36  180000  0  0   0  1

## 5. Scaling the data

In [17]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
data_scaled = pd.DataFrame(scaler.fit_transform(data),
              columns=["Number of Kids","Working Experience(years)","Age",
           "Salary","Blood Type A","Blood Type B","Blood Type AB",
           "Blood Type O"])
data_scaled

   Number of Kids  Working Experience(years)  ...  Blood Type AB  Blood Type O
0        1.507557                   1.414214  ...      -0.577350     -0.577350
1       -0.904534                  -1.414214  ...      -0.577350     -0.577350
2        0.301511                   0.000000  ...       1.732051     -0.577350
3       -0.904534                   0.000000  ...      -0.577350      1.732051

[4 rows x 8 columns]

In [18]:
data_scaled.round(decimals=2)

   Number of Kids  Working Experience(years)  ...  Blood Type AB  Blood Type O
0            1.51                       1.41  ...          -0.58         -0.58
1           -0.90                      -1.41  ...          -0.58         -0.58
2            0.30                       0.00  ...           1.73         -0.58
3           -0.90                       0.00  ...          -0.58          1.73

[4 rows x 8 columns]